%最大制动力10000N，车辆重量1500kg
%应用卡尔曼滤波算法   预测车辆的位置和速度
%小车初速度25m/s 减速度6.67m2/s 周期10Hz 0.1s一次
%位置P=V*t+1/2*a*t^2
%***************观测值******************************
t = 0:0.1:3.7;
noise = 0.1 + 0.5*randn(1,38);%均值为0.1 标准差为0.05的噪声
Z = [25*t + 0.5*(-1)*6.67*t.^2 + noise.*t; 25- 6.67*t + noise];%观测值
%***************矩阵初始化********************************
F = [1, 0.1; 0, 1];%状态转移矩阵
B = [0.1*0.1*0.5; 0.1];%控制矩阵
U = -6.67;%系统输入控制量
p_noise = 0.05 + 0.5*randn(1,38);%系统过程位置噪声 均值为0.05 标准差0.05
v_noise = 0.05 + 0.5*randn(1,38);%系统过程速度噪声 均值为0.05 标准差0.05
W = [p_noise; v_noise];%过程噪声
X = [0; 25];%系统初始状态
P = [1, 0;0, 1];%初始的最优估计的协方差矩阵
Q = [0.25, 0;0, 0.25];%先验估计的 误差协方差矩阵
H = [1,0;0,1];%观测矩阵
R = 0.25;%观测噪声方差

%***************建立迭代方程********************************
figure;
hold on ;
for i = 1:38
    X_ = F*X + B*U +W(:,i);%先验估计  计算公式 状态转移项 + 控制量项+误差
    P_ = F*P*F'+ Q;%先验估计 协方差矩阵
    K  = P_*H'/(H*P_*H' + R);%计算卡尔曼增益系数
    X = X_ + K*(Z(:,i) - H*X_);%最优估计  利用观察值对估计值进行修正
    P = (eye(2) - K*H)*P_;%更新最优估计的协方差矩阵
    
    plot(X(2),X(1),'r*');%最优估计
    plot(X_(2),X_(1),'b*');%估计值
    plot(Z(2,i),Z(1,i),'g*');%观测值
end
